app/views/faculties/_faculties.html.slim

    = render partial: 'faculties/faculty', collection: group
= paginate university.faculties.page(params[:page]).per(12)
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."university_id" = ?  [["university_id", 1]]
SELECT COUNT(*) FROM "faculties" WHERE "faculties"."university_id" = ?  [["university_id", 1]]