app/views/documents/_documents.html.slim

      = render partial: 'documents/document', collection: group
  = paginate faculty.documents.where(confirmed: true).page(params[:page]).per(12)
---
SELECT COUNT(*) FROM "documents" WHERE "documents"."faculty_id" = ? AND "documents"."confirmed" = ?  [["faculty_id", 1], ["confirmed", "t"]]