app/views/documents/_modal.html.slim

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
        p.text-muted
          = User.find(document.user_id).email
      .modal-body-info
        .row
          .col-sm-3