app/controllers/documents_controller.rb

  def create
    if document.save
---
INSERT INTO "documents" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdfsdfsdf"], ["description", "asdasdasdasdad"], ["created_at", "2016-05-14 17:52:03.877612"], ["updated_at", "2016-05-14 17:52:03.877612"]]
UPDATE "documents" SET "faculty_id" = ?, "user_id" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["faculty_id", 1], ["user_id", 4], ["updated_at", "2016-05-14 18:02:46.573655"], ["id", 6]]

  def download
    current_user.update_attributes(user_points: current_user.user_points - document.points)
---
UPDATE "users" SET "user_points" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_points", 288], ["updated_at", "2016-05-15 00:54:18.135732"], ["id", 4]]